fastjack/attiny/avr/boards.txt
menu.cpu=Processor
menu.clock=Clock

attinyx5.name=ATtinyX5
attinyx5.bootloader.tool=arduino:avrdude
attinyx5.bootloader.unlock_bits=0xff
attinyx5.bootloader.lock_bits=0xff
attinyx5.build.core=arduino:arduino
attinyx5.build.board=attiny
attinyx5.upload.tool=arduino:avrdude

attinyx4.name=ATtinyX4
attinyx4.bootloader.tool=arduino:avrdude
attinyx4.bootloader.unlock_bits=0xff
attinyx4.bootloader.lock_bits=0xff
attinyx4.build.core=arduino:arduino
attinyx4.build.board=attiny
attinyx4.upload.tool=arduino:avrdude

attinyx5.menu.cpu.attiny45=ATtiny45
attinyx5.menu.cpu.attiny45.upload.maximum_size=4096
attinyx5.menu.cpu.attiny45.build.mcu=attiny45
attinyx5.menu.cpu.attiny45.build.variant=tiny8

attinyx5.menu.cpu.attiny85=ATtiny85
attinyx5.menu.cpu.attiny85.upload.maximum_size=8192
attinyx5.menu.cpu.attiny85.build.mcu=attiny85
attinyx5.menu.cpu.attiny85.build.variant=tiny8

attinyx4.menu.cpu.attiny44=ATtiny44
attinyx4.menu.cpu.attiny44.upload.maximum_size=4096
attinyx4.menu.cpu.attiny44.build.mcu=attiny44
attinyx4.menu.cpu.attiny44.build.variant=tiny14

attinyx4.menu.cpu.attiny84=ATtiny84
attinyx4.menu.cpu.attiny84.upload.maximum_size=8192
attinyx4.menu.cpu.attiny84.build.mcu=attiny84
attinyx4.menu.cpu.attiny84.build.variant=tiny14

attinyx5.menu.clock.internal1=1 MHz (internal)
attinyx5.menu.clock.internal1.bootloader.low_fuses=0x62
attinyx5.menu.clock.internal1.bootloader.high_fuses=0xdf
attinyx5.menu.clock.internal1.bootloader.extended_fuses=0xff
attinyx5.menu.clock.internal1.build.f_cpu=1000000L

attinyx5.menu.clock.internal8=8 MHz (internal)
attinyx5.menu.clock.internal8.bootloader.low_fuses=0xe2
attinyx5.menu.clock.internal8.bootloader.high_fuses=0xdf
attinyx5.menu.clock.internal8.bootloader.extended_fuses=0xff
attinyx5.menu.clock.internal8.build.f_cpu=8000000L

attinyx5.menu.clock.internal16=16 MHz (internal)
attinyx5.menu.clock.internal16.bootloader.low_fuses=0xc1
attinyx5.menu.clock.internal16.bootloader.high_fuses=0xdf
attinyx5.menu.clock.internal16.bootloader.extended_fuses=0xff
attinyx5.menu.clock.internal16.build.f_cpu=16000000L

attinyx5.menu.clock.external8=8 MHz (external)
attinyx5.menu.clock.external8.bootloader.low_fuses=0xfe
attinyx5.menu.clock.external8.bootloader.high_fuses=0xdf
attinyx5.menu.clock.external8.bootloader.extended_fuses=0xff
attinyx5.menu.clock.external8.build.f_cpu=8000000L

attinyx5.menu.clock.external16=16 MHz (external)
attinyx5.menu.clock.external16.bootloader.low_fuses=0xfe
attinyx5.menu.clock.external16.bootloader.high_fuses=0xdf
attinyx5.menu.clock.external16.bootloader.extended_fuses=0xff
attinyx5.menu.clock.external16.build.f_cpu=16000000L

attinyx5.menu.clock.external20=20 MHz (external)
attinyx5.menu.clock.external20.bootloader.low_fuses=0xfe
attinyx5.menu.clock.external20.bootloader.high_fuses=0xdf
attinyx5.menu.clock.external20.bootloader.extended_fuses=0xff
attinyx5.menu.clock.external20.build.f_cpu=20000000L

attinyx4.menu.clock.internal1=1 MHz (internal)
attinyx4.menu.clock.internal1.bootloader.low_fuses=0x62
attinyx4.menu.clock.internal1.bootloader.high_fuses=0xdf
attinyx4.menu.clock.internal1.bootloader.extended_fuses=0xff
attinyx4.menu.clock.internal1.build.f_cpu=1000000L

attinyx4.menu.clock.internal8=8 MHz (internal)
attinyx4.menu.clock.internal8.bootloader.low_fuses=0xe2
attinyx4.menu.clock.internal8.bootloader.high_fuses=0xdf
attinyx4.menu.clock.internal8.bootloader.extended_fuses=0xff
attinyx4.menu.clock.internal8.build.f_cpu=8000000L

attinyx4.menu.clock.external8=8 MHz (external)
attinyx4.menu.clock.external8.bootloader.low_fuses=0xfe
attinyx4.menu.clock.external8.bootloader.high_fuses=0xdf
attinyx4.menu.clock.external8.bootloader.extended_fuses=0xff
attinyx4.menu.clock.external8.build.f_cpu=8000000L

attinyx4.menu.clock.external16=16 MHz (external)
attinyx4.menu.clock.external16.bootloader.low_fuses=0xfe
attinyx4.menu.clock.external16.bootloader.high_fuses=0xdf
attinyx4.menu.clock.external16.bootloader.extended_fuses=0xff
attinyx4.menu.clock.external16.build.f_cpu=16000000L

attinyx4.menu.clock.external20=20 MHz (external)
attinyx4.menu.clock.external20.bootloader.low_fuses=0xfe
attinyx4.menu.clock.external20.bootloader.high_fuses=0xdf
attinyx4.menu.clock.external20.bootloader.extended_fuses=0xff
attinyx4.menu.clock.external20.build.f_cpu=20000000L
